[
  {
    "cap": "去楼道里，一个没人会看到地方",
    "dia": [
      {
        "chr": 1,
        "id": 10001,
        "txt": "我还记得好久以前的这种感觉，是如此真实。"
      },
      {
        "chr": 0,
        "id": 10002,
        "txt": "如今的十月，还是一样的冷啊。",
        "act": {}
      },
      {
        "act": {},
        "chr": 0,
        "id": 10003,
        "txt": "那是六年前，时隔多年，第一次有人给“长大后的我”过生日。"
      },
      {
        "act": {},
        "chr": 1,
        "id": 10004,
        "txt": "二零一八年，十月九日，农历九月初一，晴转多云。"
      },
      {
        "chr": 5,
        "id": 10005,
        "txt": "新对话内容"
      }
    ],
    "pgrs": 0,
    "scene": "楼梯下"
  }
]