[
  {
    "cap": "这是任务小标题 也就是任务名",
    "dia": [
      {
        "chr": 1,
        "id": 10001,
        "txt": "这层是主线对话",
        "act": {}
      },
      {
        "chr": 0,
        "id": 10002,
        "opt": [
          {
            "dia": [
              {
                "chr": 0,
                "id": 10003,
                "txt": "这是选项1的对话内容",
                "act": {}
              },
              {
                "chr": 0,
                "id": 10004,
                "opt": [
                  {
                    "dia": [
                      {
                        "chr": 0,
                        "id": 100010,
                        "next": "第二轮",
                        "txt": "内层文本"
                      }
                    ],
                    "optn": "内层选项1"
                  },
                  {
                    "dia": [
                      {
                        "chr": 0,
                        "id": 100010,
                        "txt": "内层文本2"
                      }
                    ],
                    "optn": "内层选项2"
                  }
                ],
                "txt": "支持多层选项",
                "act": {}
              }
            ],
            "optn": "选项名字1"
          },
          {
            "dia": [
              {
                "chr": 0,
                "id": 10005,
                "txt": "这是选项2的对话内容"
              },
              {
                "chr": 0,
                "id": 10006,
                "txt": "这是选项2的对话内容2"
              }
            ],
            "optn": "选项名字2"
          }
        ],
        "txt": "下面是选项示例",
        "act": {}
      },
      {
        "act": {
          "bgm": "沉没的沉默.mp3",
          "exit": ""
        },
        "chr": 0,
        "id": 10003,
        "txt": "带函数调用的对话"
      }
    ],
    "pgrs": 0,
    "scene": "这是此轮对话名字 用于程序定位"
  },
  {
    "cap": "可以由next参数直接在对话内部跳转",
    "dia": [
      {
        "chr": 1,
        "id": 20001,
        "txt": "这层是主线对话",
        "act": {}
      },
      {
        "chr": 0,
        "id": 20002,
        "opt": [
          {
            "dia": [
              {
                "chr": 0,
                "id": 20003,
                "txt": "这是选项1的对话内容",
                "act": {}
              }
            ],
            "optn": "选项名字1"
          }
        ],
        "txt": "下面是选项示例",
        "act": {}
      }
    ],
    "pgrs": 0,
    "scene": "第二轮"
  }
]