[
  {
    "scene": "灯塔之下",
    "cap": "雾里有人影",
    "dia": [
      {
        "id": 10001,
        "chr": 1,
        "txt": "有人在那儿挥"
      },
      {
        "id": 20002,
        "chr": 0,
        "txt": "别靠太近，先确认对方意图。",
        "opt": [
          {
            "optn": "未知选项",
            "dia": [
              {
                "id": 200021,
                "chr": 0,
                "txt": "发出警示。"
              },
              {
                "id": 200022,
                "chr": 0,
                "txt": "你要承担代价。"
              }
            ]
          }
        ]
      }
    ]
  }
]